In [29]:
import pandas as pd

In [30]:
# the easier way to do this is: pd.read_csv()
ufo = pd.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv',
                   sep=',')

In [31]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [32]:
type(ufo)

pandas.core.frame.DataFrame

In [33]:
ufo_city = ufo['City']  # select a single Series (column)

In [34]:
ufo_city.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [35]:
type(ufo_city)

pandas.core.series.Series

In [36]:
ufo_city = ufo.City  # dot-notation technique for doing the above (bracket notation?)

In [37]:
ufo_city.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [38]:
type(ufo_city)

pandas.core.series.Series

Whenever a column is added to a DataFrame, the column name (Series) is added as an attribute on the pandas object. You can also access all of the methods and attribues by typing `<pandas_object>.` + `TAB-key`.

You must use bracket notation whenever there is:

- a space in the name of a Series
- a Series name that conflicts with a pandas method

In [39]:
# Here is how to make a new Series!
ufo['City_State'] = ufo['City'] + ', ' + ufo['State']

In [40]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,City_State
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

You can only make a new Series with bracket notation, not with dot notation, as shown below.

In [41]:
ufo.Location = ufo['City'] + ', ' + ufo['State']

/home/seth/anaconda3/envs/jupyter/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.